test/reports/ab_get_test_100k.txt
# ab -n 100000 -c 5  http://127.0.0.1:8080/books/bible > ab_get_test_100k.txt
This is ApacheBench, Version 2.3 <$Revision: 1663405 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        WSGIServer/0.2
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /books/bible
Document Length:        183 bytes

Concurrency Level:      1
Time taken for tests:   242.155 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      33000000 bytes
HTML transferred:       18300000 bytes
Requests per second:    412.96 [#/sec] (mean)
Time per request:       2.422 [ms] (mean)
Time per request:       2.422 [ms] (mean, across all concurrent requests)
Transfer rate:          133.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1 121.2      0   21712
Processing:     1    1  10.3      1     987
Waiting:        0    1   6.3      1     987
Total:          1    2 121.7      1   21714

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      2
  99%      3
 100%  21714 (longest request)